In [78]:
import numpy as np
import pandas as pd

In [79]:
# Series

In [80]:
grades={"Atil":40, "Bilge":90, "Lars":30}

In [81]:
pd.Series(grades)

Atil     40
Bilge    90
Lars     30
dtype: int64

In [82]:
names=["Atil","Bilge","Lars"]
grades=[40,90,30]
pd.Series(names)

0     Atil
1    Bilge
2     Lars
dtype: object

In [83]:
pd.Series(grades)

0    40
1    90
2    30
dtype: int64

In [84]:
pd.Series(grades,names)

Atil     40
Bilge    90
Lars     30
dtype: int64

In [85]:
pd.Series(names,grades)

40     Atil
90    Bilge
30     Lars
dtype: object

In [86]:
pd.Series( data=grades,index=names)

Atil     40
Bilge    90
Lars     30
dtype: int64

In [87]:
#with numpy

In [88]:
numpy_array=np.array([50,40,30,20])

In [89]:
pd.Series(numpy_array)

0    50
1    40
2    30
3    20
dtype: int64

In [90]:
#aritmethic

In [91]:
result=pd.Series(data=[10,5,100], index=["Atil","Bilge","Lars"])

In [92]:
result2=pd.Series(data=[20,50,10], index=["Atil","Bilge","Lars"])

In [93]:
result

Atil      10
Bilge      5
Lars     100
dtype: int64

In [94]:
result2

Atil     20
Bilge    50
Lars     10
dtype: int64

In [95]:
final=result+result2
final

Atil      30
Bilge     55
Lars     110
dtype: int64

In [96]:
series1=pd.Series([20,30,40,50],["a","b","c","d"])
series2=pd.Series([10,5,3,1],["a","c","f","g"])

series1+series2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

In [97]:
# Dataframe

In [98]:
data=np.random.randn(4,3)
data

array([[ 0.3043385 ,  0.30692381, -1.12247482],
       [-0.75443346, -0.17876867,  1.73077879],
       [ 1.25909523, -1.76734604,  0.08978026],
       [ 0.97268982, -1.40367998, -0.73187429]])

In [99]:
data_frame=pd.DataFrame(data)
data_frame

          0         1         2
0  0.304338  0.306924 -1.122475
1 -0.754433 -0.178769  1.730779
2  1.259095 -1.767346  0.089780
3  0.972690 -1.403680 -0.731874

In [100]:
 type(data_frame)

pandas.core.frame.DataFrame

In [101]:
data_frame[0]

0    0.304338
1   -0.754433
2    1.259095
3    0.972690
Name: 0, dtype: float64

In [102]:
type(data_frame[0])

pandas.core.series.Series

In [103]:
new_df=pd.DataFrame(data,index=["bilge","zumra","hatice","akın"],columns=["salary","age","seniority"])
new_df

          salary       age  seniority
bilge   0.304338  0.306924  -1.122475
zumra  -0.754433 -0.178769   1.730779
hatice  1.259095 -1.767346   0.089780
akın    0.972690 -1.403680  -0.731874

In [104]:
new_df["age"]

bilge     0.306924
zumra    -0.178769
hatice   -1.767346
akın     -1.403680
Name: age, dtype: float64

In [105]:
new_df[["age","salary"]]

             age    salary
bilge   0.306924  0.304338
zumra  -0.178769 -0.754433
hatice -1.767346  1.259095
akın   -1.403680  0.972690

In [106]:
new_df.loc["bilge"] #rowdan getirmek için

salary       0.304338
age          0.306924
seniority   -1.122475
Name: bilge, dtype: float64

In [107]:
new_df.iloc[0] # 0. rowdakini getir

salary       0.304338
age          0.306924
seniority   -1.122475
Name: bilge, dtype: float64

In [108]:
new_df.iloc[:,1] #:  tüm satırlar için  1. kolonu al

bilge     0.306924
zumra    -0.178769
hatice   -1.767346
akın     -1.403680
Name: age, dtype: float64

In [109]:
#data manipulation

In [110]:
new_df["extra"]=10

In [111]:
new_df

          salary       age  seniority  extra
bilge   0.304338  0.306924  -1.122475     10
zumra  -0.754433 -0.178769   1.730779     10
hatice  1.259095 -1.767346   0.089780     10
akın    0.972690 -1.403680  -0.731874     10

In [112]:
new_df.drop("extra", axis=1, inplace=True) 
# extra sutununu sil 
#( axis:1 sutun demek axis:0 satır demek)
# inplace: dataframe'in kendisinde de değiştir

In [113]:
new_df.loc["zumra"]

salary      -0.754433
age         -0.178769
seniority    1.730779
Name: zumra, dtype: float64

In [114]:
new_df.loc["zumra"]["salary"]

-0.7544334563754321

In [115]:
new_df.loc["zumra","salary"]

-0.7544334563754321

In [116]:
new_df.loc["zumra","salary"]=100
new_df

            salary       age  seniority
bilge     0.304338  0.306924  -1.122475
zumra   100.000000 -0.178769   1.730779
hatice    1.259095 -1.767346   0.089780
akın      0.972690 -1.403680  -0.731874

In [119]:
bool_frame=new_df >0
bool_frame

        salary    age  seniority
bilge     True   True      False
zumra     True  False       True
hatice    True  False       True
akın      True  False      False

In [120]:
new_df[new_df>0]

            salary       age  seniority
bilge     0.304338  0.306924        NaN
zumra   100.000000       NaN   1.730779
hatice    1.259095       NaN   0.089780
akın      0.972690       NaN        NaN

In [122]:
new_df[new_df["age"]>0]

         salary       age  seniority
bilge  0.304338  0.306924  -1.122475

In [123]:
#index

In [126]:
 reset_frame=new_df.reset_index()
reset_frame

    index      salary       age  seniority
0   bilge    0.304338  0.306924  -1.122475
1   zumra  100.000000 -0.178769   1.730779
2  hatice    1.259095 -1.767346   0.089780
3    akın    0.972690 -1.403680  -0.731874

In [127]:
reset_frame.loc[0]

index           bilge
salary       0.304338
age          0.306924
seniority   -1.122475
Name: 0, dtype: object

In [134]:
new_indices=["ati","zey","bil","meh"]
new_df["NewIndex"]=new_indices
new_df

              salary       age  seniority NewIndex
NewIndex
ati         0.304338  0.306924  -1.122475      ati
zey       100.000000 -0.178769   1.730779      zey
bil         1.259095 -1.767346   0.089780      bil
meh         0.972690 -1.403680  -0.731874      meh

In [135]:
new_df.set_index("NewIndex",inplace=True)
new_df

              salary       age  seniority
NewIndex
ati         0.304338  0.306924  -1.122475
zey       100.000000 -0.178769   1.730779
bil         1.259095 -1.767346   0.089780
meh         0.972690 -1.403680  -0.731874

In [136]:
new_df.loc["ati"]

salary       0.304338
age          0.306924
seniority   -1.122475
Name: ati, dtype: float64

In [137]:
#multi index

In [138]:
first_index=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [139]:
inner_index=["Homer","bart","marge","cartman","kenny","kyle"]

In [141]:
zipped_index=list(zip(first_index,inner_index))
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'bart'),
 ('Simpson', 'marge'),
 ('South Park', 'cartman'),
 ('South Park', 'kenny'),
 ('South Park', 'kyle')]

In [143]:
zipped_index=pd.MultiIndex.from_tuples(zipped_index)
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'bart'),
            (   'Simpson',   'marge'),
            ('South Park', 'cartman'),
            ('South Park',   'kenny'),
            ('South Park',    'kyle')],
           )

In [146]:
values=np.ones((6,2))

In [148]:
big_df=pd.DataFrame(values,index=zipped_index,columns=["age","salary"])
big_df

                    age  salary
Simpson    Homer    1.0     1.0
           bart     1.0     1.0
           marge    1.0     1.0
South Park cartman  1.0     1.0
           kenny    1.0     1.0
           kyle     1.0     1.0

In [150]:
big_df.loc["Simpson"].loc["Homer"]

age       1.0
salary    1.0
Name: Homer, dtype: float64

In [152]:
big_df["age"]

Simpson     Homer      1.0
            bart       1.0
            marge      1.0
South Park  cartman    1.0
            kenny      1.0
            kyle       1.0
Name: age, dtype: float64